hawaii-logging/src/test/resources/password-masking/20-simple-xml.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:ns="http://www.vodafone.com/nl/common/1.0" xmlns:v2="http://webservices.vodafone.nl/identitymanagement/v2"/>
    <soapenv:Body xmlns:ns="http://www.vodafone.com/nl/common/1.0" xmlns:v2="http://webservices.vodafone.nl/identitymanagement/v2">
        <v2:createOnlineUserV2>
            <createOnlineUserV2Request>
                <traceIdentifier>
                    <ns:applicationID>11125</ns:applicationID>
                    <ns:referenceID>11135</ns:referenceID>
                </traceIdentifier>
                <emailAddress>ciamdatapl116@mailinator.com</emailAddress>
                <password>{{XML_ESCAPED_PASSWORD}}</password> <!--Zero or more repetitions:-->
                <keyPassphrase>{{XML_ESCAPED_PASSWORD}}</keyPassphrase> <!--Zero or more repetitions:-->
                <contactID>950120044</contactID> <!--Optional:-->
                <confirmed>true</confirmed> <!--Optional:-->
                <securityQuestion>string</securityQuestion> <!--Optional:-->
                <securityAnswer>string</securityAnswer>
            </createOnlineUserV2Request>
        </v2:createOnlineUserV2>
    </soapenv:Body>
</soapenv:Envelope>
